parallel_cylinder_pimpleFoam_RAS/Allrun
./Allclean

#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

runApplication blockMesh

runApplication snappyHexMesh -overwrite
restore0Dir 
runApplication topoSet
runApplication createPatch -overwrite
touch refined_snappy_pipe.foam


runApplication decomposePar
runParallel pisoFoam
runApplication reconstructPar
#reconstruction complete :) means i can view results...
